In [1]:
# Packages
import requests
from bs4 import BeautifulSoup
import pandas as pd

In [2]:
# website
url = "https://umuzi-org.github.io/tech-department/projects/sql/"

In [3]:
# Package the request, send the request and catch the response to raw_data
raw_data = requests.get(url)

In [4]:
# Extracts the response as html: html_doc
html_doc = raw_data.text

In [5]:
# Create a BeautifulSoup object from the HTML: soup
soup = BeautifulSoup(html_doc)

In [6]:
# Prettify the BeautifulSoup object: pretty_soup
pretty_soup = soup.prettify()

In [7]:
# Get all the table title
table_title = []

for each_title in soup.find_all("h3")[1:]:
    table_title.append(each_title.text)

In [8]:
# Total tables in the list
print(len(table_title))

5

In [9]:
# Get all the tables
table_tags = soup.find_all("table")

In [10]:
# Total tables in the list
print(len(table_tags))

5

In [11]:
# View table title
table_title

['Customers Table',
 'Employees Table',
 'Orders Table',
 'Payments Table',
 'Products Table']

In [12]:
# Table
table_tags = soup.find_all("table")

In [27]:
#df = pd.read_html(str(table_tags[0]))

In [28]:
#df[0]

,CustomerID (int),FirstName (varchar50),LastName (varchar50),Gender (varchar),Address (varchar200),Phone (int 10),Email (varchar100),City (varchar20),Country (varchar50)
0,1,John,Hibert,Male,284 chaucer st,84789657,john@gmail.com,Johannesburg,South Africa
1,2,Thando,Sithole,Female,240 Sect 1,794445584,thando@gmail.com,Cape Town,South Africa
2,3,Leon,Glen,Male,"81 Everton Rd,Gillits",820832830,Leon@gmail.com,Durban,South Africa
3,4,Charl,Muller,Mal,290A Dorset Ecke,44856872553,Charl.muller@yahoo.com,Berlin,Germany
4,5,Julia,Stein,Female,2 Wernerring,448672445058,Js234@yahoo.com,Frankfurt,Germany

In [24]:
# Saving the Five tableS into CSV's
for index, value in enumerate(table_title):
    # html to DataFrame
    df = pd.read_html(str(table_tags[index]))
    df[0].to_csv(value.split(" ")[0] +".csv")

0 Customers.csv
1 Employees.csv
2 Orders.csv
3 Payments.csv
4 Products.csv